Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: ཆགས་པ་ཐམས་ཅད་ལས་ནི་ཡོངས་སུ་འགྲེལ་བ་མཛད།
en: to purify the conduct of all bodhisattvas;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ནི་བསྒྲུབ་པ་མཛད།
en: to fulfill the perfections of all bodhisattvas;

source: ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་འཇུག་པར་བགྱི་བའི་གླད་དུ་ནི་མངོན་དུ་གྱུར་པར་མཛད། སྙིང་རྗེ་ཆེན་པོ་ལ་ནི་རབ་ཏུ་བསྒྲུབ་པ་མཛད། བྱམས་པ་ཆེན་པོ་ལ་ནི་རབ་ཏུ་གཞོག་པ་མཛད།
en: to purify the accomplishment of the aspirations of all bodhisattvas;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ནི་རབ་ཏུ་སྦྱོར་བ་མཛད།
en: to attain the treasure of the buddha blessings of all the bodhisattvas;

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྒོམ་པ་ལ་ནི་འཛུད་པ་མཛད།
en: to obtain the unceasing light of wisdom that is all the bodhisattvas’ store of treasure of the Dharma; to realize all the bodhisattvas’ store of treasure of samādhi; to accomplish the immeasurable treasure of all the bodhisattvas;

source: རྟོགས་པར་འགྱུར་བའི་སྒོ་ལ་ནི་གནས་པར་མཛད།
en: to realize all the bodhisattvas’ store of treasure of great compassion, which is the definitive guiding of beings;

source: རང་བཞིན་ངེས་པར་རྟོགས་པ་ལ་ནི་གཞག་པར་མཛད།
en: to perceive all the bodhisattvas’ store of treasure of miracles;

source: སྟོབས་དང་ལྡན་པས་ནི་ཁྱབ་པར་མཛད།
en: and to gain the power in my own mind that is all the bodhisattvas’ store of power;

source: འགྲོ་བ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ནི་སེམས་རྣམ་པར་དབྱེ་བ་མཛད་དོ།
en: and for the array of all the aspects of all the bodhisattvas’ store of treasure of purity. “Ārya, I have come here with such a motivation, with such an intention, with such joy, with such delight, with such thoughts, with such an aspiration to accomplish certainty, with such an aspiration to conduct, with such an aspiration to comprehend the way, with such a dedication to purity, with such an intention for analysis, with such an oriented mind, with such a dedication to goodness, and with senses focused in that way. “Ārya, I have heard that you give instruction and teachings to bodhisattvas, that you teach the way, elucidate the way to understand, teach the path, bring across the ford, open the gateway of the Dharma, cut through doubts, dispel uncertainty, extract the splinter of prevarication, remove hesitancy, illuminate the darkness of the mind, eliminate the stains of the mind, clarify the continuity of the mind, remove the deception of the mind, alleviate the distress of the mind, turn the mind away from saṃsāra, lead away from bad actions, dissuade from going to the hells, bring freedom from existence, liberate from attachment, banish all clinging, create the aspiration for omniscience, enable entry into the city of the Dharma, bring to great compassion, unite with great love, conjoin with bodhisattva conduct, cause to enter the meditation of the gateway of samādhi, establish in the gateway of realization, establish in the comprehension of nature, spread the possession of the strengths, and realize the equality of all beings.

source: །ཞེས་ཐོས་ན། འཕགས་པའི་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བརྩོན་པར་བགྱི། ཇི་ལྟར་སྦྱར་བར་བགྱི། ཇི་ལྟར་བརྩོན་པར་བགྱིས་ན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པར་འགྱུར་བ་བདག་ལ་བསྟན་དུ་གསོལ།
en: “Therefore, now that I have heard that, teach me, Ārya, how bodhisattvas should learn bodhisattva conduct, how they train in it, how they are dedicated to it, and how they quickly purify the domain of bodhisattva conduct.”

source: དེ་ནས་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱིས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་ཞེས་བྱ་བ་གཟུངས་ཀྱི་སྒོ་ཀློང་མཐའ་ཡས་པ་སྔོན་དུ་འགྲོ་བ་ལ། སྔོན་གྱི་དགེ་བའི་རྩ་བའི་ཤུགས་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡང་དག་པར་བསམས་ཤིང་ཡེ་ཤེས་སྣང་བ་ཉེ་བར་བསྒྲུབས་པས་སྙོམས་པར་ཞུགས་སོ།
en: Then, at that time, the head merchant Muktaka the bodhisattva entered the gateway of samādhi, the foremost gateway to the infinite circling of the power of retention, called the assembly of all buddha realms , through the power of past roots of merit, through the blessing of the tathāgatas, and through the concentration that brings the light of wisdom of Mañjuśrī Kumāra­bhūta.

source: །ཚོང་དཔོན་བཏང་བརྗོད་དེ་ལྟར་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་དག་པ་རྣམ་པ་འདི་ལྟ་བུར་གནས་པར་གྱུར་ཏེ།
en: Immediately, the form of the head merchant Muktaka, who had entered that samādhi, became a pure body.

source: ལུས་ཡོངས་སུ་དག་པ་དེའི་མཐུས་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་བཅས། འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས། འོད་རྣམ་པར་དག་པ་དང་བཅས། སྔོན་སྤྱོད་པ་ལ་ཞུགས་པ་དང་བཅས། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས། སྨོན་ལམ་གྱི་ཚོགས་དང་བཅས། སྤྱོད་པ་དང་འབྱུང་བའི་རྒྱན་རྣམ་པར་དག་པ་དང་བཅས། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡོངས་སུ་སྟོན་པ་དང་བཅས། ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་སྟོན་པ་དང་བཅས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་བཅས། ཆོས་ཀྱི་མུའི་མཐར་ཐུག་པ་དང་བཅས་པར་ཀུན་ཀྱང་ལུས་ཀྱི་ཁོངས་སུ་ཆུད་ཅིང་འདུས་པར་སྣང་སྟེ།
en: Because of the purity of his body, there appeared within his body the presence of buddha bhagavats as numerous as the atoms in the buddha realms in the ten directions, together with their pure buddha realms, the assemblies of their pupils, their pure halos, their past practice of conduct, their buddha miracles, their accumulation of prayers, their pure display of conduct and setting forth, their demonstration of the attainment of buddhahood, their teaching the wheel of the Dharma, their ripening of beings, and their final conclusion of the Dharma.

source: དེ་དག་ཀྱང་ཕན་ཚུན་མ་འདྲེས་པ་དང་། ཕན་ཚུན་མཆོད་པ་དང་། ཕན་ཚུན་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་། ཕན་ཚུན་ཤིན་ཏུ་རྣམ་པར་གནས་པ་དང་། ཚུལ་སྣ་ཚོགས་སུ་ཞུགས་པ་དང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྒྱན་སྣ་ཚོགས་ཅན་མངའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པར་སྣང་ངོ་།
en: They were distinct from each other, were not obscuring each other, were perfectly separate from each other, were differentiated from each other, remaining in different ways, and were perceived exactly as they were. Their various arrays of buddha realms, the various adorning assemblies of bodhisattva pupils, and the appearances of various buddha miracles were seen.

source: །ཐེག་པ་སྣ་ཚོགས་རྣམ་པར་དགོད་པ་མཛད་པ་དང་། སྨོན་ལམ་གྱི་སྒོ་སྣ་ཚོགས་ཡོངས་སུ་བརྗོད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ལ་ལ་ན་ནི་དགའ་ལྡན་གྱི་ཕོ་བྲང་དུ་སྐྱེས་ཤིང་སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་ཐམས་ཅད་མཛད་པར་སྣང་ངོ་།
en: They were establishing the various yānas and reciting the various gateways of prayers. They were seen in some worlds being born in a palace in Tuṣita. They were seen to accomplish all the deeds of a buddha:

source: །ལ་ལ་ན་ནི་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོ་བ་དང་། ལ་ལ་ན་ནི་ཡུམ་གྱི་སྐུ་ན་བཞུགས་ཤིང་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་དང་། ལ་ལ་ན་ནི་སྐྱེ་བ་དང་། ལ་ལ་ན་ནི་བྱིས་པའི་རྩེད་མོ་སྟོན་པ་མཛད་པ་དང་། ལ་ལ་ན་ནི་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པ་དང་། ལ་ལ་ན་ནི་མངོན་པར་འབྱུང་བ་དང་། ལ་ལ་ན་ནི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་ཏེ།
en: in some worlds they were descending from the palace in Tuṣita; in some they were entering their mothers’ wombs and manifesting various miracles; in some they were being born; in some they demonstrated playing as children; in some they were in the middle of their harems; in some they were setting forth in renunciation; in some they were arriving at the bodhimaṇḍa;

source: རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ཆེན་པོས་བདུད་ཀྱི་སྡེ་ཕམ་པར་མཛད་པ་དང་། ལ་ལ་ན་ནི་ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟས་ཡོངས་སུ་བསྐོར་ཅིང་ཚངས་པའི་དབང་པོས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་བ་གདབ་པ་དང་། ལ་ལ་ན་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཛད་པ་དང་། ལ་ལ་ན་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་ན་བཞུགས་པ་དང་། ལ་ལ་ན་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་སྣང་ངོ་།
en: in some they were defeating the armies of Māra with vast miraculous manifestations; in some they were encircled by devas, nāgas, yakṣas, and gandharvas, and Brahmā and Indra were supplicating them to turn the wheel of the Dharma; in some they were turning the wheel of the Dharma; in some they were present in the abodes of all beings; and in some they were passing into nirvāṇa.

source: །འཇིག་རྟེན་གྱི་ཁམས་ལ་ལ་ན་ནི་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་པ་རྣམས་ཀྱིས་རིང་བསྲེལ་རྣམ་པར་དགོད་པར་སྣང་ངོ་། །སངས་རྒྱས་ཀྱི་ཞིང་ལ་ལ་ན་ནི་ལྷ་དང་མི་རྣམས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རྒྱན་གྱིས་ཀླུབས་པ་བྱེད་པར་སྣང་སྟེ།
en: In some world realms there could be seen the distribution of the relics of the tathāgatas that had passed into nirvāṇa, and in some buddha realms devas and humans could be seen covering the caityas of the tathāgatas with adornments.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སེམས་ཅན་གྱི་རིས་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་འཇིག་རྟེན་གྱི་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལམ་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་སྐྱེས་གནས་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལམ་གྱི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་བསམ་པའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་མོས་པའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་དབང་པོའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། དུས་ཀྱི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལས་ཀྱི་བྱེ་བྲག་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལས་མི་མཐུན་པ་རྣམ་པར་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་འཇིག་རྟེན་རྣམ་པར་དབྱེ་བ་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ཚུལ་ལམ་དང་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་ལ་རྣམ་པར་སྤྱོད་པ་དང་། སེམས་ཅན་རྒྱ་མཚོ་བསམ་པ་དང་སྦྱོར་བའི་རྣམ་པ་ཐ་དད་པ་དང་དབང་པོ་མི་མཐུན་པ་སྣ་ཚོགས་རྣམ་པར་དག་པ་དང་། ཉོན་མོངས་པ་དང་། བག་ཆགས་སྣ་ཚོགས་བག་ལ་ཉལ་བར་གྱུར་པའི་སེམས་ཅན་འབྱམ་ཀླས་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་བསྟན་པ་དང་། ཡུལ་སྣ་ཚོགས་ཀྱི་ངེས་པའི་ཚིག་དང་། དབྱངས་ཀྱི་ཡན་ལག་དང་གསུང་རྣམ་པ་སྣ་ཚོགས་སུ་བསྒྲུབས་པ་དང་། མདོ་སྡེ་སྣ་ཚོགས་ཀྱི་ཚུལ་རབ་ཏུ་བརྗོད་པ་དང་། གཟུངས་ཀྱི་སྒོ་རྣམ་པ་ཐ་དད་པའི་རྒྱུད་དང་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚུལ་གྱི་གཞུང་སྣ་ཚོགས་དང་། འཕགས་པའི་བདེན་པའི་མིང་རྒྱ་མཚོའི་རྒྱུད་རྣམ་པ་སྣ་ཚོགས་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་དང་སེང་གེའི་ང་རོ་རབ་ཏུ་བསྒྲགས་པ་དང་། སེམས་ཅན་གྱི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་བསྟན་པའི་ཆོ་འཕྲུལ་ཡོངས་སུ་བསྟན་པ་དང་། དྲན་པའི་སྒོ་སྣ་ཚོགས་ཅན་ཤིན་ཏུ་བསྟན་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པའི་སེང་གེའི་ང་རོ་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོའི་མཐུ་ཕྱུང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་མཐའ་དང་དབུས་མེད་པ་མཐའ་ཡས་པར་རྣམ་པར་ཐ་དད་པ་ཕན་ཚུན་མཆོད་པ་དང་། རྣམ་པར་དག་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཡངས་པ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཕྲ་བར་འདུས་པ་དང་། དཔག་ཚད་གཅིག་གི་ཚད་ཙམ་དང་། དཔག་ཚད་བཅུའི་ཚད་ཙམ་དང་། དཔག་ཚད་བརྒྱའི་ཚད་ཙམ་ནས།
en: Those buddha bhagavats were teaching among the various classes of beings, the various worlds of beings, the various modes of beings, the various births of beings, the various aggregations of beings, the various successive roots of merit of beings, the various successive modes of beings, the various successive thoughts of beings, the various successive aspirations of beings, the various successive sensory faculties of beings, the various successive times of beings, the various particular karmas of beings, the various dissimilar karmas of beings, the various worlds of beings, the various modes and conducts of beings, the various aspirations and conducts in the ocean of beings, the various, different pure faculties, and the various kleśas, predispositions, and propensities in the vast extent of beings. They did so through the demonstration of various kinds of buddha miracles, through the accomplishment of the various word definitions in various worlds, through various aspects of voice and language in various worlds, through relating the ways of various sūtras, through the processes of the various kinds of gateways to the power of retention, through the production of various kinds of discernment, through the processes of an ocean of various names for the truth, through various majestic lion’s roars of the buddhas, through the demonstration of miracles that teach the roots of merit to beings, through miracles that teach the various gateways of memory, through the lion’s roar of various prophecies to bodhisattvas, and through the power that arises from the various Dharma wheels of the tathāgatas.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཚད་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས། དེ་བཞིན་གཤེགས་པའི་གསུང་དབྱངས་ཀྱི་ཡན་ལག་དང་། སྒྲ་སྐད་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བས་ཆོས་ཇི་སྙེད་དུ་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: The buddha bhagavats taught through the aspects of the voice of a tathāgata and in accordance with all languages in the various assemblies of pupils—which are limitless, infinitely different, and dependent on one another—in the various vast, pure assemblies of pupils, in the gatherings of small assemblies of pupils, among those that are the length of one yojana, the length of ten yojanas, the length of a hundred yojanas, and so on, up to assemblies of pupils that are as many yojanas as there are atoms in even more countless than countless buddha realms.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཐོས་སོ་བླངས་སོ། །ཡང་དག་པར་བཟུང་ངོ་བསམས་སོ།
en: Sudhana, the head merchant’s son, heard, adopted, kept, and contemplated all those Dharmas that were taught.

source: །སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: He also saw those buddha miracles.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: He saw the power of the majesty of that bodhisattva samādhi.

source: །དེ་ནས་ཚོང་དཔོན་བཏང་བརྗོད་དྲན་ཞིང་ཤེས་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་རྒྱན་ཅེས་བྱ་བ་ཡོངས་སུ་བླངས་ཤིང་འཛིན་པ་སྟེ།
en: Then the head merchant Muktaka mindfully and with awareness arose from his samādhi and said to Sudhana, the head merchant’s son, “Noble one, I have obtained and hold the liberation of the tathāgatas called the unimpeded display

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་རྒྱན་དེ་ལ་རྟོག་ཅིང་དཔྱོད་པའི་ཚེ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུ་ཆུ་ཀླུང་གི་མདོག་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐར་མའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ལ་སོགས་པ།
en: “Noble one, when in that way I strove for and attained the liberation of the tathāgatas called the unimpeded display , to my eyes appeared the tathāgata arhat samyak­saṃbuddha named Tāreśvararāja in the eastern world realm called Jāmbū­nada­prabhāsa­vatī.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་། །ལྷོ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྟོབས་ཐམས་ཅད་ཀྱི་ཤུགས་དང་ལྡན་པ་ན།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Vairocana­garbha.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་ཀུན་ཏུ་རྣམ་པར་ཡངས་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པའི་རྒྱལ་པོ་ལ་སྩོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Samanta­gandha­vitāna in the southern world realm called Sarva­bala­vegavatī.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Cintārāja.

source: །ནུབ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་འོད་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་མར་མེའི་རྒྱལ་པོ་ཞེས་བྱ་བ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Meru­pradīpa­rāja in the western world realm called Sarva­gandha­prabhāsa­vatī.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆགས་པ་མེད་པའི་སེམས་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་། ཐབས་གཅིག་ཏུ་བཞུགས་པ་ཡང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Asaṅga­citta.

source: །བྱང་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ངུར་སྨྲིག་གི་རྒྱལ་མཚན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྡོ་རྗེ་རབ་ཏུ་འདུལ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་གོམ་པས་རྣམ་པར་གནོན་པ་ལ་སོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Vajra­pramardana in the northern world realm called Kāṣāyadhvajā.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པ་ཡང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Vajra­pada­vikrāmin.

source: །བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཐམས་ཅད་རབ་ཏུ་འབར་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་དམིགས་པའི་སྤྱན་རྣམ་པར་དམིགས་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་མེད་པར་ཤིན་ཏུ་སྤྲུལ་བ་ལ་སྩོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Anilambha­cakṣurvairocana in the northeastern world realm called Sarva­ratna­rucirā.

source: །ཤར་ལྷོའི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཀྱི་འོད་ཟེར་རབ་ཏུ་སྣང་བ་ན།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Gandhapradīpa in the southeastern world realm called Gandhārciḥ­prabhā­svarā.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་ཀྱི་མར་མེ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཐ་དད་པའི་དཔལ་གྱི་རྒྱལ་པོ་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Sarva­dharma­dhātu­tala­bheda­ketu­rāja.

source: །ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཉི་མའི་འོད་གཟེར་ལྟར་སྣང་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒོ་ཀུན་ནས་ཡེ་ཤེས་རྣམ་པར་སྣང་བའི་དབྱངས་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་མེ་ཏོག་གི་འོད་ཀུན་ནས་འཕྲོ་བར་གཙུག་ཕུད་རབ་ཏུ་འཕྱང་བ་ལ་སོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Samanta­mukha­jñāna­virocana­ghoṣa in the southwestern world realm called Sūrya­kesara­nirbhāsā.

source: ནུབ་བྱང་གི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཀྱི་རྒྱན་ཡིད་དུ་འོང་བའི་དགེ་བའི་སྙིང་པོ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་རྒྱ་མཚོ་ཚད་མེད་པའི་འོད་ཅེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཀྱི་འོད་ཟེར་ཐོགས་པ་མེད་པའི་གཟི་བརྗིད་རྒྱལ་པོ་བློ་གྲོས་ལ་སྩོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Apramāṇa­guṇa­sāgara­prabha in the northwestern world realm called Gandhālaṃkāra­rucira­śubha­garbhā.

source: །འོག་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་སེང་གེ་སྣང་ཞིང་འབར་བ་ན།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Dharma­dhātu­vidyotita­raśmi in the world realm below called Ratna­siṃhāvabhāsa­jvalanā.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་ཆོས་ཀྱི་དབྱིངས་སུ་སྣང་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་འོད་འཕྲོ་ཞིང་རྣམ་པར་སྣང་བར་བྱུང་བའི་བློ་གྲོས་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Dharma­dhātvarcirvairocana­saṃbhava­mati.

source: །སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་མཚན་གྱི་འོད་རྣམ་པར་སྣང་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་གྲགས་པ་ཐོགས་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་དང་། བརྩོན་འགྲུས་ཐོགས་པ་མེད་པའི་བློ་གྲོས་ལ་སོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Apratihata­guṇa­kīrti­vimokṣa­prabha­rāja in the world realm above called Akṣaṇa­rucira­vairocanā.

source: །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Asaṅga­bala­vīrya­mati.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་འདི་དག་ལ་སོགས་པ། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཐོང་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་འདིར་མི་བྱོན། ཁོ་བོ་ཡང་དེར་འགྲོ་བ་མེད་དེ་ནམ་འདོད་པ་དེ་ན་བདེ་བ་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་འོད་སྣང་མཐའ་ཡས་པ་བཞུགས་པ་འང་མཐོང་ངོ་། །ཙན་དན་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྣང་རྡོ་རྗེ་བཞུགས་པའང་མཐོང་ངོ་། །སྤོས་དྲི་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྣང་རིན་ཆེན་བཞུགས་པ་ཡང་མཐོང་ངོ་།
en: “Noble one, in that way, in addition to these ten tathāgatas, I see in the ten directions tathāgata arhat samyak­saṃbuddhas as numerous as the atoms in the buddha realms in the ten directions, but those tathāgatas have not come here and I have not gone there.

source: །པད་མོ་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་འོད་སྣང་རིན་ཆེན་པད་མོ་བཞུགས་པའང་མཐོང་ངོ་། །གསེར་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྣང་ཞི་བ་བཞུགས་པའང་མཐོང་ངོ་། །མངོན་པར་དགའ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་མི་སྒུལ་བ་བཞུགས་པའང་མཐོང་ངོ་། །ཤིན་ཏུ་བརྟན་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་སེང་གེ་བཞུགས་པའང་མཐོང་ངོ་། །མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ཟླ་བ་བཞུགས་པ་ཡང་མཐོང་ངོ་། །རིན་ཆེན་དཔལ་གྱི་དད་པས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་བཞུགས་པ་ཡང་མཐོང་ངོ་།
en: “When I wish to, I see the Tathāgata Amitābha in the buddha realm Sukhāvatī, I see the Tathāgata Vajrābha in the buddha realm Candana­vatī, I see the Tathāgata Ratnābha in the buddha realm Gandhavatī, I see the Tathāgata Ratnapadmābha in the buddha realm Padmavatī, I see the Tathāgata Śantābha in the buddha realm Kanaka­vatī, I see the Tathāgata Akṣobhya in the buddha realm Abhiratī, I see the Tathāgata Siṃha in the buddha realm Supratiṣṭhā, I see the Tathāgata Candra­buddhi in the buddha realm Ādarśa­maṇḍala­nibhāsā, and I see the Tathāgata Vairocana in the buddha realm Ratna­śrī­haṃsa­citrā.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོས་ནི་ཕྱོགས་གང་དང་གང་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་དང་གང་གིས་དེ་བཞིན་གཤེགས་པ་གང་དང་གང་མཐོང་བར་འདོད་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: “Noble one, in that way, I see whatever tathāgata I wish to, in whatever direction, in whatever world realm.

source: །དུས་གང་དང་གང་དུ་དམིགས་པ་གང་དང་གང་ལ་སྔོན་གྱི་སྤྱོད་པ་གང་དང་གང་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འདོད་པ་དང་། རྣམ་པར་འཕྲུལ་པ་གང་དང་གང་གི་དོན་དང་། སེམས་ཅན་འདུལ་བ་གང་དང་གང་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་གང་དང་གང་མཐོང་བར་འདོད་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་ཀྱང་མཐོང་སྟེ།
en: I see whatever tathāgata I wish to, in whatever time, in whatever location, in whatever past conduct. I see whatever tathāgata I wish to, wherever he is accomplishing miracles or wherever he is guiding beings.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་འདིར་གཤེགས་པ་མ་ཡིན། བདག་ཀྱང་དེར་ཕྱིན་པ་མ་ཡིན་ནོ།
en: And those tathāgatas have not come here, nor have I gone there.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་རྣམས་ག་ལས་ཀྱང་བྱོན་པ་མེད་པར་ཤེས་ལ།
en: “Noble one, in that way, I know that the tathāgatas have not come from anywhere.

source: རང་གི་ལུས་ཀྱང་གར་ཡང་འགྲོ་བ་མེད་པར་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་རྣམ་པར་དམྱིགས་པ་ཡང་རྨི་ལམ་ལྟ་བུར་ཤེས་ལ།
en: I know my own body has not gone anywhere. I know that perceiving the tathāgatas is like a dream, and I know that perceiving the activity of my own mind is like having a dream.

source: རང་གི་སེམས་རྣམ་པར་དམིགས་པ་ཡང་རྨི་ལམ་དང་འདྲ་བར་རྒྱུ་བར་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་རྣམ་པར་དམྱིགས་པ་ཡང་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་ལ་རང་གི་སེམས་རྣམ་པར་དམྱིགས་པ་ཡང་ཆུའི་སྣོད་གསལ་བ་ལྟ་བུར་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་རྣམ་པར་དམིགས་པ་ཡང་སྒྱུ་མས་བྱས་པའི་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་ལ་རང་གི་སེམས་རྣམ་པར་དམྱིགས་པ་ཡང་སྒྱུ་མ་ལྟ་བུར་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་ཡང་སྒྲ་བརྙན་རིའི་བྲག་ཆ་ལྟ་བུར་བརྗོད་པར་ཤེས་ལ་རང་གི་སེམས་རྣམ་པར་དམྱིགས་པ་ཡང་སྒྲ་བརྙན་ལྟ་བུར་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་ལས་འབྱུང་ངོ་། །ཞེས་བྱ་བར་རྗེས་སུ་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I know that the perception of the tathāgatas is like a reflection, and I know that my own mind’s perception is like a bowl of clear water. I know that the perception of the tathāgatas is like that of forms created by a magical illusion, and I know that my own mind’s perception is like a magical illusion. I know that the speech of the tathāgatas is like echoes that sound in the mountains, and I know that my own mind’s perception is like an echo. “It is thus that I understand, thus that I know that the entire Buddhadharma of the bodhisattvas arises from the blessing of one’s own mind.
